<?php

namespace Database\Seeders;

use App\Models\Question;
use App\Models\User;
// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        User::factory(10)->create();

        // User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);

        Question::factory()->create([
            'id' => 1,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'کدام یک از عبارت های زیر مجموعه تهی را مشخص می کند؟',
            'ans1' => 'عدد های صحیح بین 2- و 2',
            'ans2' => 'شمارنده های اول عدد 7',
            'ans3' => 'عدد های طبیعی بین 5 و 6',
            'ans4' => 'عددهای منفی و بزرگتر از -3',
            'tans' => 3,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 2,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'در مجموعه A={a,2,5} کدام گزینه درست است؟',
            'ans1' => '2 عضو مجموعه A است',
            'ans2' => '4 عضو مجموعه A است',
            'ans3' => '{2} عضو مجموعه A است',
            'ans4' => 'A عضو مجموعه A است',
            'tans' => 1,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 3,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'کدام یک از مجموعه های زیر تهی است؟',
            'ans1' => 'عددهای اول و زوج',
            'ans2' => 'عدد های صحیح بین -1 و 1',
            'ans3' => 'عددهای طبیعی یک رقمی و مضرب 3 و اول',
            'ans4' => 'عددهای صحیح بین -2 و -3',
            'tans' => 4,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 4,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'کدام یک از عبارت های زیر یک مجموعه را مشخص می کند؟',
            'ans1' => 'سه عدد زوج متوالی',
            'ans2' => 'سه شهر زیبای ایران',
            'ans3' => 'اعداد صحیح منفی بزرگتر از -1',
            'ans4' => 'پنج عدد کوچکتر از 6',
            'tans' => 3,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 5,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'کدام بیانگر مجموعه تهی است؟',
            'ans1' => '0',
            'ans2' => '[]',
            'ans3' => '{0}',
            'ans4' => '{}',
            'tans' => 4,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 6,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'کدام یک بیانگر یک مجموعه نیست؟',
            'ans1' => 'اعداد اول بین 24 تا 28',
            'ans2' => 'اعداد طبیعی بزرگتر از 18',
            'ans3' => 'چهار عدد طبیعی متمایز که مجموع انها 12 باشد',
            'ans4' => 'سه عدد طبیعی متمایز که مجموع انها 7 باشد',
            'tans' => 3,
            'type' => 2,
        ]);

        Question::factory()->create([
            'id' => 7,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'مجموعه  A={{۱,۲,۳}} دارای چند زیر مجموعه است؟',
            'ans1' => '1',
            'ans2' => '2',
            'ans3' => '3',
            'ans4' => '4',
            'tans' => 1,
            'type' => 2,
        ]);

        Question::factory()->create([
            'id' => 8,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'یک مجموعه ۱۶ زیرمجموعه دارد. تعداد عضوهای این مجموعه کدام است؟',
            'ans1' => '16',
            'ans2' => '8',
            'ans3' => '4',
            'ans4' => '2',
            'tans' => 3,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 9,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'کدام گزینه نمایش مجموعه‌ی عددهای طبیعی فرد می‌باشد؟',
            'ans1' => '{۲x|x∈N}',
            'ans2' => '{۲x+۱|x∈N}',
            'ans3' => '{۲x−۱|x∈W}',
            'ans4' => '{۲x+۱|x∈W}',
            'tans' => 4,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 11,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'مجموعه‌ی S={{x},{{x}},x,x}دارای چند عضو است؟',
            'ans1' => '1',
            'ans2' => '2',
            'ans3' => '3',
            'ans4' => '4',
            'tans' => 3,
            'type' => 1,
        ]);

        Question::factory()->create([
            'id' => 12,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'بزرگ‌ترین عضو مجموعه‌ی{۳x−۵|x∈Z,۲^(x)<√۱۱} کدام است؟',
            'ans1' => '-2',
            'ans2' => '1',
            'ans3' => '4',
            'ans4' => '-5',
            'tans' => 1,
            'type' => 2,
        ]);

        Question::factory()->create([
            'id' => 13,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'اختلاف تعداد زير مجموعه‌های يك مجموعه (k+۲) عضوی با مجموعه (k-۲) عضوی برابر با ۴۸۰ است. تعداد عضوهای مجموعه بزرگ‌تر كدام است؟',
            'ans1' => '7',
            'ans2' => '6',
            'ans3' => '8',
            'ans4' => '9',
            'tans' => 4,
            'type' => 3,
        ]);

        Question::factory()->create([
            'id' => 14,
            'unit' => 1,
            'lesson' => 2,
            'qtext' => 'اگر A={a+۵,۲,۶} و B={b−۷,۶,۹} دو مجموعه مساوی باشند. آن گاه کدام گزینه درست نیست؟',
            'ans1' => 'A⊆B',
            'ans2' => '۱۳ = a +b',
            'ans3' => '۲∈B',
            'ans4' => '۹∉A',
            'tans' => 4,
            'type' => 3,
        ]);

        Question::factory()->create([
            'id' => 15,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'تعدادی از دانش اموزان "راهنمایی دخترانه" و "دبیرستان دخترانه" را به اردو برده اند. تعداد دانش اموزانی که از "راهنمایی دخترانه" در اردو شرکت کرده اند برابر است با تعداد دانش اموزانی که از "دبیرستان دخترانه" در اردو شرکت نکرده اند.',
            'ans1' => 'تعداد دانش اموزانی که در اردو شرکت کرده اند بیشتر است از تعداد دانش اموزان دبیرستان دخترانه',
            'ans2' => 'تعداد دانش اموزانی که در اردو شرکت کرده اند کمتر است از تعداد دانش اموزان دبیرستان دخترانه',
            'ans3' => 'تعداد دانش اموزانی که در اردو شرکت کرده اند برابر است از تعداد دانش اموزان دبیرستان دخترانه',
            'ans4' => 'مسئله اطلاعات کافی نداده است',
            'tans' => 3,
            'type' => 3,
        ]);

        Question::factory()->create([
            'id' => 16,
            'unit' => 1,
            'lesson' => 1,
            'qtext' => 'مجموعه زیر چند عضو دارد؟ {2^(11)+2 , 2^(11)+4 , ... , 2^(12)}',
            'ans1' => '2^(12)',
            'ans2' => '2^(9)',
            'ans3' => '2^(10)',
            'ans4' => '2^(11)',
            'tans' => 3,
            'type' => 3,
        ]);
    }
}
