<x-layout>
    @if(session('success'))
        <div id="flash">
            {{session('success')}}
        </div>
    @endif
    <div class="about-text">
            <h2>درباره MathLife</h2>
            <p>
                MathLife یک پلتفرم آموزشی آنلاین است که به دانش‌آموزان پایه نهم کمک می‌کند تا ریاضیات را به روشی جذاب، تعاملی و موثر یاد بگیرند. این سایت شامل درس‌نامه‌های کامل برای هر فصل از کتاب ریاضی است که با توضیحات ساده و مفهومی طراحی شده‌اند. همچنین، ما آزمون‌های تعاملی فراهم کرده‌ایم تا دانش‌آموزان بعد از مطالعه هر درس، توانایی‌های خود را بسنجند و پیشرفت خود را مشاهده کنند.
            </p>
            <p>
                از ویژگی‌های برجسته MathLife می‌توان به موارد زیر اشاره کرد:
            </p>
            <ul>
                <li><i class="fas fa-check-circle"></i> درس‌نامه‌های جامع و قابل فهم برای هر فصل کتاب ریاضی پایه نهم.</li>
                <li><i class="fas fa-check-circle"></i> آزمون‌های تعاملی که به دانش‌آموزان این امکان را می‌دهند تا خود را محک بزنند و نقاط قوت و ضعف خود را شناسایی کنند.</li>
                <li><i class="fas fa-check-circle"></i> رابط کاربری ساده و جذاب که به راحتی قابل استفاده است.</li>
                <li><i class="fas fa-check-circle"></i> پیگیری پیشرفت، مشاهده نمرات و تعیین هدف‌های آموزشی شخصی برای هر کاربر.</li>
                <li><i class="fas fa-check-circle"></i> امکان دسترسی به منابع آموزشی از هر مکان و در هر زمان.</li>
            </ul>
            <p>
                هدف ما این است که فرآیند یادگیری ریاضی را برای شما ساده‌تر، جذاب‌تر و سرگرم‌کننده‌تر کنیم. با MathLife، شما به راحتی می‌توانید مهارت‌های ریاضی خود را تقویت کرده و نمرات بهتری کسب کنید.
            </p>     
    </div>
</x-layout>